init.org
#+TITLE: Emacs init file written in org-mode
#+AUTHOR: Julio Toss
#+EMAIL: julio.toss@imag.fr
#+STARTUP: indent logdrawer
#+LANGUAGE: en
#+OPTIONS: H:3 num:nil toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS: author:nil email:nil creator:nil timestamp:nil
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+LANGUAGE: en
#+TAGS: JULIO(J) noexport(n)

This file is my =.emacs= configuration file (more precisely my
=~/.emacs.d/init.el= configuration). I stole it from Luka Stanisic who
stole parts from mine a long time ago and cleaned (with org-mode) and
improved everything. It is so convenient that I think it is time to
share it. Note that it comprises my personal website publishing
configuration that you should not really need but that you can inspire
on.

To have a nice emacs configuration, you'll need:
- emacs24 (>24.3) (this way installing through elpa will save you some
  time) and emacs-goodies (e.g., for color themes)
- org-mode > 8.2 (there has been a major compatibility breakage so
  need to stay away from old versions)
- ess and R
- texlive and auctex
If you're a Mac OS X user, [[../blog/2014/05/15/emacs_and_orgmode_on_macosx.org][read this]].

other exaple of configurations: https://carlhu.com/orgmode

I took the original version of this file at http://mescal.imag.fr/membres/arnaud.legrand/misc/init.php

* Installation Instructions
Then copy it into =~/.emacs.d/init.org=. 

- *If you are using Mac OS X, remove every line containing the word
  =xclip= in this file* (you may also be interested in reading [[file:../blog/2014/05/15/emacs_and_orgmode_on_macosx.org][this blog entry]]).
- Otherwise, you should consider installing xclip (=sudo apt-get
    install xclip= in a shell and =M-x package-install= the =xclip= package
  within emacs) as it will ease interactions with emacs when running
  in a terminal.

Then do =M-x org-babel-load-file= (=M-x= means pressing =Alt= and =x=
simultaneously to get the emacs prompt that allows you to call emacs
functions, also remember you can press =Tab= to activate auto
completion) and provide =~/.emacs.d/init.org=. This should evaluate
every piece of emacs-lisp code available here.

Next time, simply reload changes with "C-c i". If some stuff does not
work (in particular in the org-mode website generation section or in
the tabs section), just comment them and proceeed.

* Hack to customize the configuration file                           :JULIO:

- [X] Discover why this block is not beeing tangled.  
  This was because of the PROPERTY block in the BEGIN_EXAMPLE drawer was
  actually taken into account.

We hack into the internal archiving function so it disables the
tangling in acrhived tree. This way we can enable and disable headings
by using =C-c C-x a= . 

The code block bellow adds the following property in archived trees:
#+BEGIN_EXAMPLE 
  :header-args:    :tangle no
#+END_EXAMPLE

#+BEGIN_SRC emacs-lisp
(require 'org)
(eval-after-load "org-archive"
  '(defun org-toggle-archive-tag (&optional find-done)
    "Toggle the archive tag for the current headline.
  With prefix ARG, check all children of current headline and offer tagging
  the children that do not contain any open TODO items."
    (interactive "P")
    (if (and (org-region-active-p) org-loop-over-headlines-in-active-region)
        (let ((cl (if (eq org-loop-over-headlines-in-active-region 'start-level)
                      'region-start-level 'region))
              org-loop-over-headlines-in-active-region)
          (org-map-entries
           `(org-toggle-archive-tag ,find-done)
           org-loop-over-headlines-in-active-region
           cl (if (outline-invisible-p) (org-end-of-subtree nil t))))
      (if find-done
          (org-archive-all-done 'tag)
        (let (set)
          (save-excursion
            (org-back-to-heading t)
            (setq set (org-toggle-tag org-archive-tag))
            (when set (hide-subtree)))
          (if (org-entry-get (point) "header-args")  
              (org-delete-property "header-args" )
            (org-set-property
             "header-args"
             ":tangle no"))      
          (and set (beginning-of-line 1))
          (message "Subtree %s" (if set "archived" "unarchived"))))))
)
#+END_SRC

#+RESULTS:
: org-toggle-archive-tag

* Loading files:
** ELPA
#+BEGIN_SRC emacs-lisp
(require 'package)
(package-initialize)
(setq package-archives
'( ;("ELPA" . "http://tromey.com/elpa/")
   ("gnu" . "http://elpa.gnu.org/packages/")
   ("melpa" . "http://melpa.org/packages/")
   ("marmalade" . "http://marmalade-repo.org/packages/")))
#+END_SRC
** Adding .el files stored in folder elisp:                    :WEB:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/lib/elisp/")
(add-to-list 'load-path "~/.emacs.d/elpa/org-20150302/")
(add-to-list 'load-path "~/.emacs.d/elpa/xclip-1.3/")
(add-to-list 'load-path "~/.emacs.d/elpa/htmlize-20130207.1202/")
(add-to-list 'load-path "~/.emacs.d/elpa/polymode-20151013.814/")
(add-to-list 'load-path "~/.emacs.d/elpa/lua-mode-20150518.942/")
(add-to-list 'load-path "~/.emacs.d/elpa/toc-org-20150801.748/")
;;(require 'org-git-link) ;; Made some personal modifications
#+END_SRC
[10:42:15; 24.06.2013]
** Loading babel:                                                    :ARNAUD:
#+BEGIN_SRC emacs-lisp
(require 'org-install)
(require 'org)
;; (require 'org-html)
#+END_SRC
[17:28:05; 30.05.2013]
** Font lock                                                   :WEB:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:ORDERED:  t
:END:
Useful if you want to export org files in batch mode...
#+BEGIN_SRC emacs-lisp
(require 'font-lock)      
(require 'cc-mode) 
(c-after-font-lock-init)
#+END_SRC
** File/mode association                                            :ARNAUD:
:PROPERTIES:
:END:
#+BEGIN_SRC emacs-lisp
(setq auto-mode-alist
   (append (mapcar 'purecopy
      '(("\\.c$"   . c-mode)
	("\\.h$"   . c-mode)
	("\\.c.simp$" . c-mode)
	("\\.h.simp$" . c-mode)
	("\\.a$"   . c-mode)
	("\\.w$"   . cweb-mode)
	("\\.cc$"   . c++-mode)
	("\\.S$"   . asm-mode)
	("\\.s$"   . asm-mode)
	("\\.p$"   . pascal-mode)
	("\\.Rmd$" . poly-markdown-mode)
	("\\.pas$" . pascal-mode)
	("\\.tex$" . LaTeX-mode)
	("\\.txi$" . Texinfo-mode)
	("\\.el$"  . emacs-lisp-mode)
;;	("emacs"  . emacs-lisp-mode)
	("\\.ml[iylp]?" . tuareg-mode)
	("[mM]akefile" . makefile-mode)
	("[mM]akefile.*" . makefile-mode)
	("\\.mak" . makefile-mode)
	("\\.cshrc" . sh-mode)
	("\\.html$" . html-mode)
        ("\\.org$" . org-mode)
        ("\\.md$" . markdown-mode)
)) auto-mode-alist))
#+END_SRC
* Emacs aesthetics:
** Remove splash screen:                                                :WEB:
#+BEGIN_SRC emacs-lisp
(setq inhibit-splash-screen t)
#+END_SRC
[16:29:14; 24.04.2013]
** Keep the list of recent files                                      :JULIO:
Bug with tramp and recent files:
https://www.emacswiki.org/emacs/RecentFiles#toc9
#+BEGIN_SRC emacs-lisp
(require 'recentf)
(setq recentf-auto-cleanup 'never) ;; disable before we start recentf!
(recentf-mode 1)
(setq recentf-max-menu-items 25)
(global-set-key "\C-x\ \C-r" 'recentf-open-files)
#+END_SRC
** Change frame name of emacs:                                     :LUKA:WEB:
#+BEGIN_SRC emacs-lisp
(setq frame-title-format
  '("Emacs - " (buffer-file-name "%f"
    (dired-directory dired-directory "%b"))))
#+END_SRC
[16:29:40; 24.04.2013]
** Font size                                                :ARNAUD:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC emacs-lisp
(set-default-font "9x15")
#+END_SRC
** Text coloring                                                    :ARNAUD:
#+BEGIN_SRC emacs-lisp
  (global-font-lock-mode t)
  (custom-set-faces
    '(flyspell-incorrect ((t (:inverse-video t)))))
  ;;  (set-face-attribute 'flyspell-incorrect (t (:inverse-video t)))
#+END_SRC
** Line and column numbering                                        :ARNAUD:
#+BEGIN_SRC emacs-lisp
(line-number-mode 1)
(column-number-mode 1)
#+END_SRC
** Parenthesis                                                       :ARNAUD:
#+BEGIN_SRC emacs-lisp
(load-library "paren")
(show-paren-mode 1)
(transient-mark-mode t)
(require 'paren)
#+END_SRC
** Confirmation to exit emacs                                        :JULIO:
#+BEGIN_SRC emacs-lisp
(add-hook 'kill-emacs-query-functions
          (lambda () (y-or-n-p "Do you really want to exit Emacs? "))
          'append)
#+END_SRC
** Disable touch-pad on emacs                                :JULIO:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
[17:58:54; 24.01.2016]

https://www.reddit.com/r/emacs/comments/38o0tr/i_have_to_share_this_switch_your_touchpad_off/


This only make sense if you have a touchpad. Otherwise you'll get an
error message like:
: Couldn't find synaptics properties. No synaptics driver loaded?

#+begin_src emacs-lisp
(defun turn-off-mouse (&optional frame)
  (interactive)
  (let ((inhibit-message t) (default-directory "~"))
    (shell-command "synclient TouchpadOff=1")))

(defun turn-on-mouse (&optional frame)
  (interactive)
  (let ((inhibit-message t) (default-directory "~"))
    (shell-command "synclient TouchpadOff=0")))

(add-hook 'focus-in-hook #'turn-off-mouse)
(add-hook 'focus-out-hook #'turn-on-mouse)
(add-hook 'delete-frame-functions #'turn-on-mouse)
#+end_src

#+RESULTS:
| turn-on-mouse |

** Swap buffers in windows                                          :JULIO:
<2016-02-09 mar.>
http://stackoverflow.com/a/1774949
#+begin_src emacs-lisp
(defun swap-buffers-in-windows ()
  "Put the buffer from the selected window in next window, and vice versa"
  (interactive)
  (let* ((this (selected-window))
     (other (next-window))
     (this-buffer (window-buffer this))
     (other-buffer (window-buffer other)))
    (set-window-buffer other this-buffer)
    (set-window-buffer this other-buffer)
    )
  )
#+end_src

#+RESULTS:
: swap-buffers-in-windows

Set a shortcut for this function
#+begin_src emacs-lisp
(global-set-key (kbd "C-x 4 t") 'swap-buffers-in-windows) 
#+end_src

#+RESULTS:
: swap-buffers-in-windows

** Evilmode                                                          :JULIO:
Emulates the Vim commands in emacs
#+begin_src emacs-lisp
(setq evil-want-C-i-jump nil)
(require 'evil)
(evil-mode 1)
#+end_src

** Save Emacs session on exit                                        :JULIO:
#+begin_src emacs-lisp
(desktop-save-mode 1)
#+end_src

** Start Emacs as server for use emacsclient                         :JULIO:
https://anxiousmofo.wordpress.com/2008/08/04/opening-files-in-an-already-running-instance-of-emacs/
#+begin_src emacs-lisp
(server-start)
#+end_src

* Shortcuts:
:PROPERTIES:
:END:
** Load emacs initialization file:                                     :LUKA:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c i") 
(lambda() (interactive)(org-babel-load-file "~/.emacs.d/init.org")))
#+END_SRC
[16:28:10; 24.04.2013]
** UTF 8 by default                                                  :ARNAUD:
#+BEGIN_SRC emacs-lisp
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+END_SRC
