init.org
** Keyboard fix for Mac OS X users...                       :ADRIEN:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
Thanks to Adrien Lebre for providing me with this
=ns-use-mac-modifier-symbols= thing. Unfortunately, this is broken at
the moment (I tried to wrap the command around the cond but it should
fail on mac). 
#+BEGIN_SRC emacs-lisp
(cond
 ((string-equal system-type "darwin")   ; Mac OS X
  (progn
    (setq
     ns-command-modifier 'meta         ; Apple/Command key is Meta
	 ns-alternate-modifier nil         ; Option is the Mac Option key
	 ns-use-mac-modifier-symbols  nil  ; display standard Emacs (and not standard Mac) modifier symbols
	 ))
  )
 )
#+END_SRC
** CUA mode a.k.a =C-x, C-c, C-v=                                  :ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
Yuck! Many people like this but I hate it as it conflicts with some of
my other shortcuts (e.g., the ones for spelling a region).
#+BEGIN_SRC emacs-lisp
;; (cua-mode t)
#+END_SRC
** Hide/show the C block:                                          :LUKA:WEB:
#+BEGIN_SRC emacs-lisp
(add-hook 'c-mode-common-hook
  (lambda()
    (local-set-key (kbd "C-c <right>") 'hs-show-block)
    (local-set-key (kbd "C-c <left>")  'hs-hide-block)
    (local-set-key (kbd "C-c <up>")    'hs-hide-all)
    (local-set-key (kbd "C-c <down>")  'hs-show-all)
    (hs-minor-mode t)))
#+END_SRC
[16:32:57; 24.04.2013]

** Reload buffer:                                                    :ARNAUD:
#+BEGIN_SRC emacs-lisp
(global-set-key [f10] '(lambda () (interactive) (revert-buffer nil t nil)))
#+END_SRC
[16:34:57; 24.04.2013]
** Compile / Make
#+BEGIN_SRC emacs-lisp
(global-set-key "\^x\^e" 'compile)
#+END_SRC
** Navigate back in text                                             :ARNAUD:
#+BEGIN_SRC emacs-lisp
(defun jump-mark ()
  (interactive)
  (set-mark-command (point)))
(defun beginning-of-defun-and-mark ()
  (interactive)
  (push-mark (point))
  (beginning-of-defun))
(defun end-of-defun-and-mark ()
  (interactive)
  (push-mark (point))
  (end-of-defun))

(global-set-key "\^c\^b" 'beginning-of-defun-and-mark)
(global-set-key "\^c\^e" 'end-of-defun-and-mark)
(global-set-key "\^c\^j" 'jump-mark)
(global-set-key [S-f6] 'jump-mark)		;; jump from mark to mark
#+END_SRC
** Goto line                                                         :ARNAUD:
#+BEGIN_SRC emacs-lisp
(global-set-key "\M-g" 'goto-line)
#+END_SRC
** Use X clipboard (cut'n paste)                                        :WEB:
Since I switched to emacs 24, cutting and pasting to emacs has
become burdensome. For example, I had to do S-C-c after selecting
terminals areas before being able to copy in emacs. With the
following commants, I don't have to do this anymore. I wish it
would have eased interactions when running emacs in a terminal
(i.e., with =-nw=) but it does not. :( [[http://stackoverflow.com/questions/13036155/how-to-to-combine-emacs-primary-clipboard-copy-and-paste-behavior-on-ms-windows]]
#+BEGIN_SRC emacs-lisp
(setq select-active-regions nil)
(setq x-select-enable-primary t)
(setq x-select-enable-clipboard t)
(setq mouse-drag-copy-region t)
#+END_SRC
** Cut'n paste in no-window mode                                        :WEB:
Despite what can be found in many old discussions on emacs mailing
lists, it seems to be possible and the trick is to use xclip!
[[http://stackoverflow.com/questions/4580835/emacs-copy-kill-ring-to-system-clipboard-in-nowindow-mode]]   [[http://stackoverflow.com/questions/5288213/how-can-i-paste-the-selected-region-outside-of-emacs/14659015#14659015]]

If you simply use the following commands, then emacs cut-n-paste works
just perfectly with the X clipboard. I can select in emacs no window
and then paste with the middle-click button! :) Many thanks to Vijay
for pointing me out that I had forgotten the "require" line... :)
#+BEGIN_SRC emacs-lisp
;;  (if(string-equal system-type "gnu/linux")   ; Linux!
;;      (
       (require (quote xclip))
       (xclip-mode 1)
;;      )()
;;        )
#+END_SRC
** Increase/decrease text size in emacs                                 :WEB:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
;; C-x C-0 restores the default font size
#+END_SRC
[11:26:47; 18.04.2014]
** Add spell checker to the file                                       :WEB:
:PROPERTIES:
:END:
#+BEGIN_SRC emacs-lisp
;; Inspired from http://tex.stackexchange.com/questions/166681/changing-language-of-flyspell-emacs-with-a-shortcut
;; (defun spell (choice)
;;    "Switch between language dictionaries."
;;    (interactive "cChoose:  (a) American | (f) Francais")
;;     (cond ((eq choice ?1)
;;            (setq flyspell-default-dictionary "american")
;;            (setq ispell-dictionary "american")
;;            (ispell-kill-ispell))
;;           ((eq choice ?2)
;;            (setq flyspell-default-dictionary "francais")
;;            (setq ispell-dictionary "francais")
;;            (ispell-kill-ispell))
;;           (t (message "No changes have been made."))) )

(define-key global-map (kbd "C-c s a") (lambda () (interactive) (ispell-change-dictionary "american")))
(define-key global-map (kbd "C-c s f") (lambda () (interactive) (ispell-change-dictionary "francais")))
(define-key global-map (kbd "C-c s r") 'flyspell-region)
(define-key global-map (kbd "C-c s b") 'flyspell-buffer)
(define-key global-map (kbd "C-c s s") 'flyspell-mode)
#+END_SRC
* Small fixes:
** PDF with LaTeX by default                                         :ARNAUD:
#+BEGIN_SRC emacs-lisp
(defun auto-fill-mode-on () (TeX-PDF-mode 1))
(add-hook 'tex-mode-hook 'TeX-PDF-mode-on)
(add-hook 'latex-mode-hook 'TeX-PDF-mode-on)
(setq TeX-PDF-mode t)
#+END_SRC
** Auto-fill-mode
#+BEGIN_SRC emacs-lisp
(defun auto-fill-mode-on () (auto-fill-mode 1))
(add-hook 'text-mode-hook 'auto-fill-mode-on)
(add-hook 'emacs-lisp-mode 'auto-fill-mode-on)
(add-hook 'tex-mode-hook 'auto-fill-mode-on)
(add-hook 'latex-mode-hook 'auto-fill-mode-on)
#+END_SRC
** C coding style                                                       :WEB:
From [[http://www.emacswiki.org/emacs/IndentingC]].
#+BEGIN_SRC emacs-lisp
  (setq c-default-style "k&r")
  (setq c-basic-offset 2)
#+END_SRC
** Convenient shortcut to reindent C files                         :ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC emacs-lisp
 (defun c-reformat-buffer()
    (interactive)
    (save-buffer)
    (setq sh-indent-command (concat
                             "indent -i2 -kr --no-tabs"
                             buffer-file-name
                             )
          )
    (mark-whole-buffer)
    (universal-argument)
    (shell-command-on-region
     (point-min)
     (point-max)
     sh-indent-command
     (buffer-name)
     )
    (save-buffer)
    )
  (define-key c-mode-base-map [f7] 'c-reformat-buffer)
#+END_SRC
** Asking for confirmation concisely:                                   :WEB:
Link: [[http://org.ryuslash.org/dotfiles/emacs/init.html#sec-7-1]] Being
asked to type in yes explicitly all the time gets very tedious. I
understand that it is safer since y is much easier to type in
accidentally than yes and so the potential to say yes to things you
don't want is there, but I haven't had any such problems yet.

#+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
[16:27:20; 24.04.2013]
** Fix problem of using dead-keys                                    :JULIO:
:PROPERTIES:
:END:
#+begin_src emacs-lisp
  (require 'iso-transl)
#+end_src

* Org-mode convenient configuration
** Default directory
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org/")
#+END_SRC
** Cosmetics
#+BEGIN_SRC emacs-lisp
(setq org-hide-leading-stars t)
(setq org-alphabetical-lists t)
(setq org-src-fontify-natively t)  ;; you want this to activate coloring in blocks
(setq org-src-tab-acts-natively t) ;; you want this to have completion in blocks
(setq org-hide-emphasis-markers t) ;; to hide the *,=, or / markers
(setq org-pretty-entities t)       ;; to have \alpha, \to and others display as utf8 http://orgmode.org/manual/Special-symbols.html
(setq org-startup-indented t)      ;; turn on org-indent-mode for all files
(setq org-log-into-drawer t)       ;; insert notes into :LOGBOOK: drawer 
;;(setq org-cycle-include-plain-lists 'integrate) ;; fold plain list when cycling heading visibility
(setq org-cycle-include-plain-lists (quote integrate))
#+END_SRC

** Agenda
*** Add short cut keys for the org-agenda                            :ARNAUD:
#+BEGIN_SRC emacs-lisp
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-cc" 'org-capture)
(global-set-key (kbd "C-c a") 'org-agenda)
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map (kbd "C-c a") 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)
(setq org-default-notes-file "~/org/notes.org")
     (define-key global-map "\C-cd" 'org-capture)
(setq org-capture-templates (quote (("t" "Todo" entry (file+headline "~/org/liste.org" "Tasks") "* TODO %?
  %i
  %a" :prepend t) ("j" "Journal" entry (file+datetree "~/org/journal.org") "* %?
Entered on %U
  %i
  %a"))))
#+END_SRC

*** Agenda config                                                    :ARNAUD:
#+BEGIN_SRC emacs-lisp
(setq org-agenda-include-all-todo t)
(setq org-agenda-include-diary t)
;;displays the agenda starting today
;;(setq org-agenda-start-on-weekday nil)
;;displays the agenda starting today
(setq org-agenda-start-on-weekday 1)

(setq org-agenda-skip-scheduled-if-done t)

(setq org-agenda-sorting-strategy (quote 
((agenda habit-down time-up priority-down category-keep) (todo category-up priority-down) (tags priority-down category-keep) (search category-keep))))
#+END_SRC

**** Default org-agenda-files

#+begin_src emacs-lisp
(setq org-agenda-files (quote (
"~/Copy/Doutorado/activity-log.org"
"~/Copy/julio-personal.org"
)))
#+end_src

**** Extra files to add to the agenda
These files are the org files of the projects that I am currently 
working on. 

#+begin_src emacs-lisp
; Adds new file to track on the agenda
(push "~/Projects/hppsimulations/LabBook.org" org-agenda-files)
(push "~/Projects/hppsimulations/WORKING_DOC/pma.org" org-agenda-files)
(push "~/Projects/hppsimulations/newpma/newpma.org" org-agenda-files)

(push "~/Copy/Projects/ParVoronoi-wiki/graphprocessing.org" org-agenda-files)

#+end_src

*** TODO Google agenda                                     :ARNAUD:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
How does he exports its google agenda to org?
#+BEGIN_SRC emacs-lisp
(setq org-agenda-files (quote ("~/org/liste.org" "~/org/google.org")))
(setq revert-without-query (quote ("google.org")))
#+END_SRC

** Org-id for storing objects ???                           :ARNAUD:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC emacs-lisp
(setq org-id-method (quote uuidgen))
#+END_SRC

