init.org
** Setting "Wrap at window edge" for .org mode:                :WEB:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC emacs-lisp
 (global-visual-line-mode t)
#+END_SRC

[16:32:35; 24.04.2013]

** Heading is DONE when all checkboxes are checked:                     :WEB:
Mark heading done when all checkboxes are checked.

An item consists of a list with checkboxes. When all of the checkboxes
are checked, the item should be considered complete and its TODO state
should be automatically changed to DONE. The code below does
that. This version is slightly enhanced over the one in the mailing
list (see
[[http://thread.gmane.org/gmane.emacs.orgmode/42715/focus=42721]]) to
reset the state back to TODO if a checkbox is unchecked.

Note that the code requires that a checkbox statistics cookie (the [/]
or [%] thingie in the headline - see the Checkboxes section in the
manual) be present in order for it to work. Note also that it is too
dumb to figure out whether the item has a TODO state in the first
place: if there is a statistics cookie, a TODO/DONE state will be
added willy-nilly any time that the statistics cookie is changed.

#+BEGIN_SRC emacs-lisp
;; see http://thread.gmane.org/gmane.emacs.orgmode/42715
(eval-after-load 'org-list
  '(add-hook 'org-checkbox-statistics-hook (function ndk/checkbox-list-complete)))

(defun ndk/checkbox-list-complete ()
  (save-excursion
    (org-back-to-heading t)
    (let ((beg (point)) end)
      (end-of-line)
      (setq end (point))
      (goto-char beg)
      (if (re-search-forward "\\[\\([0-9]*%\\)\\]\\|\\[\\([0-9]*\\)/\\([0-9]*\\)\\]" end t)
            (if (match-end 1)
                (if (equal (match-string 1) "100%")
                    ;; all done - do the state change
                    (org-todo 'done)
                  (org-todo 'todo))
              (if (and (> (match-end 2) (match-beginning 2))
                       (equal (match-string 2) (match-string 3)))
                  (org-todo 'done)
                (org-todo 'todo)))))))
#+END_SRC

[16:27:59; 24.04.2013]

** Clocking work                                                     :JULIO:
Put clock log into a drawer
#+BEGIN_SRC emacs-lisp
(setq org-clock-into-drawer t)
#+END_SRC

** TODO Link to attachment files                                      :JULIO:
https://lists.gnu.org/archive/html/emacs-orgmode/2008-11/msg00108.html

TO FIX: org-attach-expand-link is only defined after we do =C-c C-a=
(open the attachment options buffers) . 
#+BEGIN_SRC emacs-lisp
(eval-after-load 'ord-attach 
  (setq org-link-abbrev-alist '(("att" . org-attach-expand-link))))
#+END_SRC

#+RESULTS:

** Inline tasks                                                      :JULIO:
#+begin_src emacs-lisp
(require 'org-inlinetask)
#+end_src
** Ditaa                                                  :JULIO:
#+begin_src emacs-lisp
(setq org-ditaa-jar-path "/usr/bin/ditaa")
#+end_src
* Org-mode shortcuts
** Adding date with brackets with command "C-c d":                     :LUKA:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c d") 'insert-date)
(defun insert-date (prefix)
    "Insert the current date. With prefix-argument, use ISO format. With
   two prefix arguments, write out the day and month name."
    (interactive "P")
    (let ((format (cond
                   ((not prefix) "** %Y-%m-%d")
                   ((equal prefix '(4)) "[%Y-%m-%d]"))))
      (insert (format-time-string format))))
#+END_SRC
[16:34:01; 24.04.2013]

** Adding date with command "C-c t":                                   :LUKA:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c t") 'insert-time-date)
(defun insert-time-date (prefix)
    "Insert the current date. With prefix-argument, use ISO format. With
   two prefix arguments, write out the day and month name."
    (interactive "P")
    (let ((format (cond
                   ((not prefix) "[%H:%M:%S; %d.%m.%Y]")
                   ((equal prefix '(4)) "[%H:%M:%S; %Y-%m-%d]"))))
      (insert (format-time-string format))))
#+END_SRC
[16:34:15; 24.04.2013]

** Fix view TODO tree:                                        :LUKA:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c v") 'org-show-todo-tree)
#+END_SRC
[16:34:40; 24.04.2013]
** Org-store-link:                                                   :ARNAUD:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c l") 'org-store-link)
#+END_SRC
[16:35:48; 24.04.2013]

** Adding shortcut for interactively inserting git link:               :LUKA:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c g") 'org-git-insert-link-interactively)
#+END_SRC
[16:36:31; 24.04.2013]

** Adding shortcut for data entry:                            :LUKA:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no 
:END:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c e") (lambda ()
                  (interactive)
		  (insert "** data#\n*** git:\n#+begin_src sh\ngit log -1\n#+end_src\n*** Notes:" )))
		  ;;(insert "** data#\n[[shell:git log -1][git]]\n" )))
                  ;;(insert "** data#\n[[shell:git log -1][git]]\n" (format-time-string "[%H:%M:%S; %d.%m.%Y]" ))))
#+END_SRC
[16:36:15; 24.04.2013]

** Navigating through org-mode:
Additional shortcuts for navigating through org-mode documents:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c <up>") 'outline-up-heading)
(global-set-key (kbd "C-c <left>") 'outline-previous-visible-heading)
(global-set-key (kbd "C-c <right>") 'outline-next-visible-heading)
#+END_SRC
[18:01:07; 27.05.2013]

** Narrowing
Convenient built-in shortcuts.
#+BEGIN_EXAMPLE
C-x n s     (org-narrow-to-subtree)
    Narrow buffer to current subtree.
C-x n b     (org-narrow-to-block)
    Narrow buffer to current block.
C-x n w     (widen)
    Widen buffer to remove narrowing.

C-c C-x b     (org-tree-to-indirect-buffer)
    Show current tree in an indirect buffer 
#+END_EXAMPLE

*** Narrow region to indirect buffer                                :JULIO:
The "indirect buffer" lets you have two different views of the same
file.

http://demonastery.org/2013/04/emacs-narrow-to-region-indirect/

#+begin_src emacs-lisp
(defun narrow-to-region-indirect (start end)
  "Restrict editing in this buffer to the current region, indirectly."
  (interactive "r")
  (deactivate-mark)
  (let ((buf (clone-indirect-buffer nil nil)))
    (with-current-buffer buf
      (narrow-to-region start end))
      (switch-to-buffer buf)))
#+end_src

** Navigating through org-sparse-tree                                :JULIO:
Next and previous occurence on the sparse tree
#+BEGIN_SRC emacs-lisp
;(global-set-key (kbd "C-x <dead-grave>") 'next-error)
;(global-set-key (kbd "C-x <S-dead-tilde>") 'previous-error)

(global-set-key (kbd "M-n") 'next-error)
(global-set-key (kbd "M-p") 'previous-error)
#+END_SRC

* Org-mode + babel:
** Seamless use of babel (no confirmation, lazy export)             :ARNAUD:
:PROPERTIES:
:END:
#+BEGIN_SRC emacs-lisp
(setq org-export-babel-evaluate nil)
(setq org-confirm-babel-evaluate nil)
#+END_SRC
** Some initial languages we want org-babel to support:              :ARNAUD:
#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (C . t)
     (sh . t)
     (python . t)
     (R . t)
     (ruby . t)
     (ocaml . t)
     (ditaa . t)
     (dot . t)
     (octave . t)
     (sqlite . t)
     (perl . t)
     (screen . t)
     (plantuml . t)
     (lilypond . t)
     (org . t)
     (makefile . t)
     (latex . t)
     ))
  (setq org-src-preserve-indentation t)
#+END_SRC

** Adding source code blocks:                                          :LUKA:
*** With capital letters:
To use this type <S and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("S" "#+begin_src ?\n\n#+end_src" "<src lang=\"?\">\n\n</src>"))
#+END_SRC

*** Emacs-elisp code:
To use this type <m and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("m" "#+begin_src emacs-lisp\n\n#+end_src" "<src lang=\"emacs-lisp\">\n\n</src>"))
#+END_SRC

*** R code:
To use this type <r and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("r" "#+begin_src R :results output :session :exports both\n?\n#+end_src" "<src lang=\"R\">\n\n</src>"))
#+END_SRC

To use this type <R and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("R" "#+begin_src R :results output graphics :file (org-babel-temp-file \"figure\" \".png\") :exports both :width 600 :height 400 :session\n?\n#+end_src" "<src lang=\"R\">\n\n</src>"))
#+END_SRC

*** Python code:
To use this type <p and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("p" "#+begin_src python :results output :exports both\n?\n#+end_src" "<src lang=\"python\">\n\n</src>"))

(add-to-list 'org-structure-template-alist
        '("P" "#+begin_src python :results output :exports both :session\n?\n#+end_src" "<src lang=\"python\">\n\n</src>"))
#+END_SRC

https://github.com/gregsexton/ob-ipython#tips-and-tricks
Ipython must have a :session argument
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("ip" "#+begin_src ipython :exports both :session\n?\n#+end_src" "<src lang=\"ipython\">\n\n</src>"))

(add-to-list 'org-structure-template-alist
        '("IP" "#+begin_src ipython :exports both :session ?\n\n#+end_src" "<src lang=\"ipython\">\n\n</src>"))
#+END_SRC

*** Bash "sh" code:
To use this type <b and then TAB
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("b" "#+begin_src sh :results output :exports both\n?\n#+end_src" "<src lang=\"sh\">\n\n</src>"))
#+END_SRC

To use this type <B and then TAB. This comes with a session argument
(e.g., in case you want to keep ssh connexions open).
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
        '("B" "#+begin_src sh :session ? :results output :exports both \n\n#+end_src" "<src lang=\"sh\">\n\n</src>"))
#+END_SRC


[18:23:44; 21.06.2013]

*** C/C++ code:                                                       :JULIO:

C++ 11 
#+begin_src emacs-lisp
(add-to-list 'org-structure-template-alist
        '("CPP" "#+begin_src C++ :flags -std=c++11 :includes <iostream> \n\n#+end_src" "<src lang=\"c++\">\n\n</src>"))
#+end_src 

C 
#+begin_src emacs-lisp
(add-to-list 'org-structure-template-alist
        '("C" "#+begin_src C :includes <stdio.h> \n\n#+end_src" "<src lang=\"c\">\n\n</src>"))
#+end_src 

** Evaluating whole subtree:                                           :LUKA:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c S-t") 'org-babel-execute-subtree)
#+END_SRC

[15:25:16; 17.12.2013]
** Display images                                                    :ARNAUD:
#+BEGIN_SRC emacs-lisp
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images) 
(add-hook 'org-mode-hook 'org-display-inline-images)
(add-hook 'org-mode-hook 'org-babel-result-hide-all)
#+END_SRC
