init.org
** TODO Ipython configuration                                         :JULIO:
*** Use python3
:PROPERTIES:
:END:

for having python3 sessions.  
#+begin_src emacs-lisp
(setq python-shell-interpreter "python3")
#+end_src

For executing wihtout session this is enough
#+begin_src emacs-lisp
(setq org-babel-python-command "python3")
#+end_src

*** Old Ipython configuration                                     :ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
For now I just use this simple configuration explain here:
http://permalink.gmane.org/gmane.emacs.orgmode/79488

A better solution should do something like this
https://github.com/gregsexton/ob-ipython

For having ipython sessions.  
#+begin_src emacs-lisp
 (setq python-shell-interpreter "python3"
        ;; org mode seems to work better with classic mode. . .
        python-shell-interpreter-args "--classic --no-banner"
        python-shell-completion-setup-code
        "from IPython.core.completerlib import module_completion"
        python-shell-completion-module-string-code
        "';'.join(module_completion('''%s'''))\n"
        python-shell-completion-string-code
        "';'.join(get_ipython().Completer.all_completions('''%s'''))\n")

#+end_src

For executing wihtout session this is enough
#+begin_src emacs-lisp
(setq org-babel-python-command "python3 --no-banner --classic --no-confirm-exit")
#+end_src

*** Ipython Babel evaluation

https://github.com/gregsexton/ob-ipython

#+begin_src emacs-lisp
(require 'ob-ipython)
#+end_src

Solve bug "Searching for program: no such file or directory, ipython"
https://github.com/gregsexton/ob-ipython/issues/52
#+begin_src emacs-lisp
(setq exec-path (append '("/home/julio/anaconda3/bin") exec-path))
#+end_src


** Noweb evaluation                                                  :JULIO:
use fast name resolution of noweb reference .  
#+begin_src emacs-lisp
(setq org-babel-use-quick-and-dirty-noweb-expansion t)
#+end_src

* Org-mode + bibtex
:PROPERTIES:
:END:
** Org-ref configuration
https://github.com/jkitchin/org-ref

#+begin_src emacs-lisp
(require 'org-ref)
(setq reftex-default-bibliography '("~/Documents/Mendeley/library.bib"))
#+end_src

#+RESULTS:
| ~/Documents/Mendeley/library.bib |

#+begin_src emacs-lisp
(setq 
 ;org-ref-bibliography-notes "~/Dropbox/bibliography/notes.org"
 org-ref-default-bibliography '("~/Documents/Mendeley/library.bib")
 ;org-ref-pdf-directory "~/Dropbox/bibliography/bibtex-pdfs/"
 )
#+end_src

#+RESULTS:
| ~/Documents/Mendeley/library.bib |

** TODO Helm-bibtex configuration                                     :JULIO:
  https://github.com/tmalsburg/helm-bibtex
  - [ ] find a way to automatically load helm-bibtex. Currently for
    the links to work we have to manually call M-x helm-bibtex once to
    load the library.
    
*** Basic setup of helm-bibtex
:LOGBOOK:  
- Note taken on [2016-05-06 Sex 11:24] \\
  Updated configuration to new version of HELM
:END:      
:END:

Set the path to bibtex library.
#+BEGIN_SRC emacs-lisp
;; Sets the path to my bibtex file (which is generated by Mendeley) 
(setq bibtex-completion-bibliography '("~/Documents/Mendeley/library.bib"))

;; Configure the field on the bibtex that contains the path to the pdf file.
(setq bibtex-completion-pdf-field "file")
#+END_SRC

#+RESULTS:
: file

*** TODO Helm key-bindings
:PROPERTIES:
:END:
Doesn't work... I wanted to replace the reftex shortcut
#+begin_src emacs-lisp
;;Search bibtex
;;(global-set-key (kbd "C-c C-x [") 'helm-bibtex)
#+end_src

#+RESULTS:
: helm-bibtex

*** Fix the helm function to find the pdf in field                :ARCHIVE:
:LOGBOOK:  
- Note taken on [2016-05-06 Sex 13:20] \\
  After the new version of helm-bibtex this fix is no more needed.
:END:      
:PROPERTIES:
:header-args: :tangle no
:END:
Last two lines were modified to match the syntax of the /file/ field of
the bibtex generated by Mendeley. 

#+BEGIN_SRC emacs-lisp
(eval-after-load "helm-bibtex" 
'(defun helm-bibtex-find-pdf-in-field (key-or-entry)
    "Returns the path of the PDF specified in the field
`helm-bibtex-pdf-field' if that file exists.  Returns nil if no
file is specified, or if the specified file does not exist, or if
`helm-bibtex-pdf-field' is nil."

    (when helm-bibtex-pdf-field
      (let* ((entry (if (stringp key-or-entry)
			(helm-bibtex-get-entry1 key-or-entry t)
		      key-or-entry))
	     (value (helm-bibtex-get-value helm-bibtex-pdf-field entry)))
	(cond
	 ((not value) nil)         ; Field not defined.
	 ((f-file? value) value)   ; A bare path was found.
	 (t				; Assuming Zotero/Mendeley/JabRef format:
	  (cl-loop  ; Looping over the files:
	   for record in (s-split ";" value)
	   for record = (s-split ":" record)
	   for file-name = (nth 0 record)
	   for path = (nth 1 record)
	   if (f-file? path)
	   collect (f-full path)
	   else if (f-file? (f-full (f-join path file-name)))
	   collect (f-full (f-join path file-name))
	   ;; This is to work around a bug in Mendeley.
	   else if (f-file? (concat "/" path))
	   collect ( concat "/" path))))))))

#+END_SRC

#+RESULTS:

*** DONE Use Mendeley as default pdfviewer with helm
:LOGBOOK:
- Note taken on [2015-11-26 jeu. 14:40] \\
  The problem is shows up when I add the (require 'helm-bibtex)
- Note taken on [2015-11-26 jeu. 14:27] \\
  This setup is givin me some error on startup of emacs. 
  "wrong-type-argument keymapp nil"
:END:
:PROPERTIES:
:END:
this is the "<f2>" shortcut on helm-bibtex
#+BEGIN_SRC emacs-lisp
;;(require 'helm-bibtex)
;;(setq helm-bibtex-pdf-open-function
;;      (lambda (fpath)
;;	(start-process "mendeleydesktop" "*helm-bibtex-mendeleydesktop*" "/usr/bin/mendeleydesktop" fpath)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;;(require 'helm-bibtex)
(setq bibtex-completion-pdf-open-function
      (lambda (fpath)
	(call-process "mendeleydesktop" nil 0 nil fpath)))
#+END_SRC

#+RESULTS:
| lambda | (fpath) | (start-process mendeleydesktop *helm-bibtex-mendeleydesktop* /usr/bin/mendeleydesktop fpath) |

*** Insert org-mode citation as a link to the pdf file            :ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
This is the <f3> shortcut on helm-bibitex.

#+BEGIN_SRC emacs-lisp
(setq helm-bibtex-format-citation-functions
      '((org-mode      . helm-bibtex-format-citation-org-link-to-PDF)
	      (latex-mode    . helm-bibtex-format-citation-cite)
	      (markdown-mode . helm-bibtex-format-citation-pandoc-citeproc)
	      (default       . helm-bibtex-format-citation-default)))
#+END_SRC

*** Insert org-mode citation as a new custom link type
:PROPERTIES:
:END:
This is the <f1> shortcut on helm-bibitex.
**** Create a custom link type [[BIB::key]]
http://orgmode.org/manual/Adding-hyperlink-types.html#Adding-hyperlink-types

Convert a link type BIB:Toss2014 to \cite{Toss2014} on the pdf exporter. 
https://lists.gnu.org/archive/html/emacs-orgmode/2010-12/msg00629.html

#+BEGIN_SRC emacs-lisp 
(require 'org)
(org-add-link-type "BIB" 'org-bib-open 
(lambda (path desc format)
  (cond
   ((eq format 'latex)
    (format "\\cite{%s}" path))))) 

;;(add-hook 'org-store-link-functions 'org-bib-store-link)

(defun org-bib-open (path)
  "Uses the helm functions to look up the path on the bibtex."
  (funcall bibtex-completion-pdf-open-function (nth 0 (bibtex-completion-find-pdf-in-field path ))))

#+END_SRC

#+RESULTS:
: org-bib-open

**** Configure helm-bibtex to insert our new kind of link as citation

#+BEGIN_SRC emacs-lisp
(defun bibtex-completion-format-citation-BIB (keys)
  "Formatter for BIB references."
  (s-join ", "
          (--map (format "BIB:%s" it) keys)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq bibtex-completion-format-citation-functions
      '((org-mode      . bibtex-completion-format-citation-BIB)
	      (latex-mode    . bibtex-completion-format-citation-cite)
	      (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
	      (default       . bibtex-completion-format-citation-default)))
#+END_SRC

* Org-mode LaTeX export
:PROPERTIES:
:END:
** Clear default values                                      :JULIO:ARCHIVE:
:PROPERTIES:
:header-args: :tangle no
:END:
To remove the default headers added on the latex export.
#+begin_src emacs-lisp
(unless (boundp 'org-latex-classes) (setq org-latex-classes nil))
#+end_src

** ACM                                                              :ARNAUD:
#+BEGIN_SRC emacs-lisp
 ;; Clear the default values for this class
 ;; (unless (boundp 'org-latex-classes) (setq org-latex-classes nil))

 (add-to-list 'org-latex-classes '("acm-proc-article-sp" "\\documentclass{acm_proc_article-sp}\n \[NO-DEFAULT-PACKAGES]\n \[EXTRA]\n  \\usepackage{graphicx}\n  \\usepackage{hyperref}"  ("\\section{%s}" . "\\section*{%s}") ("\\subsection{%s}" . "\\subsection*{%s}")                       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")                       ("\\paragraph{%s}" . "\\paragraph*{%s}")                       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(setq org-latex-to-pdf-process '("pdflatex -interaction nonstopmode -output-directory %o %f ; bibtex `basename %f | sed 's/\.tex//'` ; pdflatex -interaction nonstopmode -output-directory  %o %f ; pdflatex -interaction nonstopmode -output-directory %o %f"))

;(setq org-latex-to-pdf-process '("bibtex `basename %f | sed 's/\.tex//'`"))


#+END_SRC

#+RESULTS:
| pdflatex -interaction nonstopmode -output-directory %o %f ; bibtex `basename %f | sed 's/.tex//'` ; pdflatex -interaction nonstopmode -output-directory  %o %f ; pdflatex -interaction nonstopmode -output-directory %o %f |

*** General articles                                         :LUKA:ARCHIVE:
:LOGBOOK:  
- Note taken on [2016-03-14 lun. 12:49] \\
  let the emacs defaults for article class
:END:      
:PROPERTIES:
:header-args: :tangle no
:END:      
I'm not completely sure I need this. I could probably remove it...
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-classes '("article" "\\documentclass{article}\n \[NO-DEFAULT-PACKAGES]\n \[EXTRA]\n  \\usepackage{graphicx}\n  \\usepackage{hyperref}"  ("\\section{%s}" . "\\section*{%s}") ("\\subsection{%s}" . "\\subsection*{%s}")                       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")                       ("\\paragraph{%s}" . "\\paragraph*{%s}")                       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC

[15:18:27; 16.05.2013]

** Beamer
https://gitlab.com/yuvallanger/worg/blob/ed18772a5015bee9159d55459bbfee4bda669414/exporters/beamer/ox-beamer.org
#+begin_src emacs-lisp
(add-to-list 'org-latex-classes
             '("beamer"
               "\\documentclass\[presentation\]\{beamer\}"
               ("\\section\{%s\}" . "\\section*\{%s\}")
               ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
               ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))
#+end_src 

* Org-mode for github
