init.el
       ;; org mode seems to work better with classic mode. . .
       python-shell-interpreter-args "--classic --no-banner"
       python-shell-completion-setup-code
       "from IPython.core.completerlib import module_completion"
       python-shell-completion-module-string-code
       "';'.join(module_completion('''%s'''))\n"
       python-shell-completion-string-code
       "';'.join(get_ipython().Completer.all_completions('''%s'''))\n")

(setq org-babel-python-command "ipython --no-banner --classic --no-confirm-exit")

(setq org-babel-use-quick-and-dirty-noweb-expansion t)

(require 'org-ref)
(setq reftex-default-bibliography '("~/Copy/Doutorado/papers/library.bib"))

(setq 
 ;org-ref-bibliography-notes "~/Dropbox/bibliography/notes.org"
 org-ref-default-bibliography '("~/Copy/Doutorado/papers/library.bib")
 ;org-ref-pdf-directory "~/Dropbox/bibliography/bibtex-pdfs/"
 )

;;(require 'helm-bibtex)
;; Sets the path to my bibtex file (which is generated by Mendeley) 
(setq helm-bibtex-bibliography '("~/Copy/Doutorado/papers/library.bib"))

;; Configure the field on the bibtex that contains the path to the pdf file.
(setq helm-bibtex-pdf-field "file")

(eval-after-load "helm-bibtex" 
'(defun helm-bibtex-find-pdf-in-field (key-or-entry)
    "Returns the path of the PDF specified in the field
`helm-bibtex-pdf-field' if that file exists.  Returns nil if no
file is specified, or if the specified file does not exist, or if
`helm-bibtex-pdf-field' is nil."

    (when helm-bibtex-pdf-field
      (let* ((entry (if (stringp key-or-entry)
                        (helm-bibtex-get-entry1 key-or-entry t)
                      key-or-entry))
             (value (helm-bibtex-get-value helm-bibtex-pdf-field entry)))
        (cond
         ((not value) nil)         ; Field not defined.
         ((f-file? value) value)   ; A bare path was found.
         (t                             ; Assuming Zotero/Mendeley/JabRef format:
          (cl-loop  ; Looping over the files:
           for record in (s-split ";" value)
           for record = (s-split ":" record)
           for file-name = (nth 0 record)
           for path = (nth 1 record)
           if (f-file? path)
           collect (f-full path)
           else if (f-file? (f-full (f-join path file-name)))
           collect (f-full (f-join path file-name))
           ;; This is to work around a bug in Mendeley.
           else if (f-file? (concat "/" path))
           collect ( concat "/" path))))))))

;;(require 'helm-bibtex)
(setq helm-bibtex-pdf-open-function
      (lambda (fpath)
        (start-process "mendeleydesktop" "*helm-bibtex-mendeleydesktop*" "/usr/bin/mendeleydesktop" fpath)))

(require 'org)
(org-add-link-type "BIB" 'org-bib-open 
(lambda (path desc format)
  (cond
   ((eq format 'latex)
    (format "\\cite{%s}" path))))) 

;;(add-hook 'org-store-link-functions 'org-bib-store-link)

;(require 'helm-bibtex)
(defun org-bib-open (path)
  "Uses the helm functions to look up the path on the bibtex."
  (funcall helm-bibtex-pdf-open-function (nth 0 (helm-bibtex-find-pdf-in-field path ))))

(defun helm-bibtex-format-citation-BIB (keys)
  "Formatter for BIB references."
  (s-join ", "
          (--map (format "BIB:%s" it) keys)))

(setq helm-bibtex-format-citation-functions
      '((org-mode      . helm-bibtex-format-citation-BIB)
              (latex-mode    . helm-bibtex-format-citation-cite)
              (markdown-mode . helm-bibtex-format-citation-pandoc-citeproc)
              (default       . helm-bibtex-format-citation-default)))

;; Clear the default values for this class
 ;; (unless (boundp 'org-latex-classes) (setq org-latex-classes nil))

 (add-to-list 'org-latex-classes '("acm-proc-article-sp" "\\documentclass{acm_proc_article-sp}\n \[NO-DEFAULT-PACKAGES]\n \[EXTRA]\n  \\usepackage{graphicx}\n  \\usepackage{hyperref}"  ("\\section{%s}" . "\\section*{%s}") ("\\subsection{%s}" . "\\subsection*{%s}")                       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")                       ("\\paragraph{%s}" . "\\paragraph*{%s}")                       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
(setq org-latex-to-pdf-process '("pdflatex -interaction nonstopmode -output-directory %o %f ; bibtex `basename %f | sed 's/\.tex//'` ; pdflatex -interaction nonstopmode -output-directory  %o %f ; pdflatex -interaction nonstopmode -output-directory %o %f"))

;(setq org-latex-to-pdf-process '("bibtex `basename %f | sed 's/\.tex//'`"))

(add-to-list 'org-latex-classes
             '("beamer"
               "\\documentclass\[presentation\]\{beamer\}"
               ("\\section\{%s\}" . "\\section*\{%s\}")
               ("\\subsection\{%s\}" . "\\subsection*\{%s\}")
               ("\\subsubsection\{%s\}" . "\\subsubsection*\{%s\}")))
