init.org
** toc-org
[[https://github.com/snosov1/toc-org][toc-org]] helps you to have an up-to-date table of contents in org files
without exporting (useful primarily for readme files on GitHub).
#+BEGIN_SRC emacs-lisp
(if (require 'toc-org nil t)
    (add-hook 'org-mode-hook 'toc-org-enable)
  (warn "toc-org not found"))
#+END_SRC
Now, every time I save an org file, the first headline with a :TOC:
tag will be updated with the current table of contents.
* Remote file editing-TRAMP:                                            :WEB:
This is installed by default for most of emacs Remote File Editing
Using Emacs

Emacs has a package called TRAMP (Transparent Remote (file) Access,
Multiple Protocol) which allows you to edit files on remote machines
via SSH. Since Emacs 22, TRAMP is included with the distribution.

All you need to do is add the following lines to your .emacs file,

#+BEGIN_SRC emacs-lisp
(require 'tramp)
(setq tramp-default-method "ssh")
#+END_SRC

Then in order to open a file on a remote machine, you can use,

C-x C-f /user@your.host.com:/path/to/file

If you don't want to enter your password every time you open or save a
file consider using Public Key Authentication.

TRAMP mode can also be used to edit files on the same machine as
another user, if you want to open some file as root you can use,

    C-x C-f /root@127.0.0.1:/path/to/file

[12:25:12; 13.06.2013]
* Custom-set-variables                                                :JULIO:
Copy of the old configuration on my init.el that emacs put
automatically.

#+BEGIN_SRC emacs-lisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(custom-enabled-themes (quote (tango-dark)))
 '(display-buffer-alist nil)
 '(markdown-command "pandoc")
'(org-html-postamble-format (quote (("en" "<p class=\"author\">Author: %a (%e)</p>
<p class=\"date\">Date: %d</p>")))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )

#+END_SRC
